liebherrnenzing/canpie-fd_device/stm32/hal/stm32_canpie-fd.c
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreBufferGetDlc()                                                       //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreBufferGetDlc(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, uint8_t * pubDlcV)
{
	CpStatus_tv tvStatusT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		//----------------------------------------------------------------
		// read DLC from simulated CAN buffer
		//
		*pubDlcV = atsCan1MsgS[ubBufferIdxV].ubMsgDLC;
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreBufferRelease()                                                      //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreBufferRelease(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV)
{
	CpStatus_tv tvStatusT;
	HAL_StatusTypeDef hal_status = HAL_OK;
	CpStatus_tv status;
	uint8_t filter_number;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		// release filter

		// check if the buffer is already defined to a filter
		status = search_for_already_defined_filter(ubBufferIdxV, &filter_number);

		// it is not really nice but I use the status to check if a filter exists or not
		// if (eCP_ERR_INIT_FAIL == status)
		// {
		// there is no filter assigned to this buffer so do nothing
		// }

		if (eCP_ERR_NONE == status)
		{
			// clear filter
			hal_status = can_filter_config(0, 0, 0, filter_number, CAN_RX_FIFO0, 0);
		}

		// clear buffer
		memset(&atsCan1MsgS[ubBufferIdxV], 0x00, sizeof(CpCanMsg_ts));

		// set buffer to invalid
		atsCan1MsgS[ubBufferIdxV].ulMsgUser = CP_BUFFER_IVAL;
	}

	if (HAL_OK != hal_status)
	{
		return eCP_ERR_INIT_FAIL;
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreBufferSend()                                                         //
// send message out of the CAN controller                                     //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreBufferSend(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV)
{
	CpStatus_tv tvStatusT;
	uint32_t tx_mailbox;
	CAN_TxHeaderTypeDef tx_header;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);

//	// check if buffer is used for tx and valid
//	if((atsCan1MsgS[ubBufferIdxV].ulMsgUser & (CP_BUFFER_VAL | CP_BUFFER_TRM)) != (CP_BUFFER_VAL | CP_BUFFER_TRM))
//	{
//		return eCP_ERR_BUFFER;
//	}

	if (tvStatusT == eCP_ERR_NONE)
	{
		//-----------------------------------------------------------------
		// setup identifier
		//
		if (CpMsgIsExtended(&atsCan1MsgS[ubBufferIdxV]))
		{
			tx_header.ExtId = atsCan1MsgS[ubBufferIdxV].ulIdentifier;
			tx_header.IDE = CAN_ID_EXT;
		}
		else
		{
			tx_header.StdId = atsCan1MsgS[ubBufferIdxV].ulIdentifier;
			tx_header.IDE = CAN_ID_STD;
		}

		//-----------------------------------------------------------------
		// check for RTR bit
		//
		if (CpMsgIsRemote(&atsCan1MsgS[ubBufferIdxV]))
		{
			tx_header.RTR = CAN_RTR_REMOTE;
		}
		else
		{
			tx_header.RTR = CAN_RTR_DATA;
		}

		tx_header.DLC = atsCan1MsgS[ubBufferIdxV].ubMsgDLC;
		tx_header.TransmitGlobalTime = DISABLE;

		if (HAL_CAN_AddTxMessage(&HCAN1, &tx_header, &atsCan1MsgS[ubBufferIdxV].tuMsgData.aubByte[0], &tx_mailbox) != HAL_OK)
		{
			//---------------------------------------------------
			// mark this buffer for transmission,
			// the transmission will be done in the CAN Tx
			// interrupt
			//
			atsCan1MsgS[ubBufferIdxV].ulMsgUser |= CP_BUFFER_PND;
			return eCP_ERR_TRM_FULL;
		}
		else
		{
			/* save which buffer was used for tx */
			switch (tx_mailbox)
			{
				case 1:
					tx_mailbox = 0;
					break;
				case 2:
					tx_mailbox = 1;
					break;
				case 4:
					tx_mailbox = 2;
					break;
				default:
					return eCP_ERR_GENERIC;
					break;
			}

			tx_mailbox_to_buffer[tx_mailbox] = ubBufferIdxV;
		}
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreBufferSetData()                                                      //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreBufferSetData(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, uint8_t * pubSrcDataV, uint8_t ubStartPosV, uint8_t ubSizeV)
{
	CpStatus_tv tvStatusT;
	uint8_t ubCntT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		//--------------------------------------------------------
		// test start position and size
		//
		if ((ubStartPosV + ubSizeV) > CP_DATA_SIZE)
		{
			tvStatusT = eCP_ERR_PARAM;
		}
		else
		{
			//---------------------------------------------------
			// copy data from simulated CAN buffer
			//
			for (ubCntT = ubStartPosV; ubCntT < ubSizeV; ubCntT++)
			{
				// alternative way but maybe not so fast
				CpMsgSetData(&atsCan1MsgS[ubBufferIdxV], ubCntT, *pubSrcDataV);
				//atsCan1MsgS[ubBufferIdxV].tuMsgData.aubByte[ubCntT] = *pubSrcDataV;
				pubSrcDataV++;
			}
		}
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreBufferSetDlc()                                                       //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreBufferSetDlc(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, uint8_t ubDlcV)
{
	CpStatus_tv tvStatusT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		//--------------------------------------------------------
		// write DLC to simulated CAN buffer
		//
		// alternative way but maybe not so fast
		// CpMsgSetDlc(atsCan1MsgS[ubBufferIdxV], ubDlcV);
		atsCan1MsgS[ubBufferIdxV].ubMsgDLC = ubDlcV;
	}

