liebherrnenzing/canpie-fd_device/stm32/hal/stm32_canpie-fd.c
	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreCanMode()                                                            //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreCanMode(CpPort_ts * ptsPortV, uint8_t ubModeV)
{
	HAL_StatusTypeDef hal_status = HAL_OK;
	HAL_StatusTypeDef hal_status1 = HAL_OK;
	HAL_StatusTypeDef hal_status2 = HAL_OK;
	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;

	//----------------------------------------------------------------
	// test CAN port
	//
	if (ptsPortV != (CpPort_ts *) 0L)
	{
		if (ptsPortV->ubDrvInfo > eDRV_INFO_OFF)
		{
			tvStatusT = eCP_ERR_NONE;
//----------------------------------------------------------------
// switch CAN controller into mode "ubModeV"
//
			switch (ubModeV)
			{
				//--------------------------------------------------------
				// Stop the CAN controller (passive on the bus)
				//
				case eCP_MODE_STOP:
					hal_status = HAL_CAN_Stop(&HCAN1);
					hal_status1 = HAL_CAN_DeactivateNotification(&HCAN1, CAN_IT_TX_MAILBOX_EMPTY | CAN_IT_RX_FIFO0_MSG_PENDING |  CAN_IT_RX_FIFO1_MSG_PENDING | CAN_IT_ERROR_WARNING | CAN_IT_ERROR_PASSIVE | CAN_IT_BUSOFF | CAN_IT_LAST_ERROR_CODE | CAN_IT_ERROR);
					break;

					//--------------------------------------------------------
					// Start the CAN controller (active on the bus)
					//
				case eCP_MODE_START:
					hal_status = HAL_CAN_ActivateNotification(&HCAN1, CAN_IT_RX_FIFO0_MSG_PENDING | CAN_IT_RX_FIFO1_MSG_PENDING | CAN_IT_TX_MAILBOX_EMPTY);
					hal_status1 = HAL_CAN_Start(&HCAN1);
					break;

					//--------------------------------------------------------
					// Start the CAN controller (Listen-Only)
					//
				case eCP_MODE_LISTEN_ONLY:
					HCAN1.Init.Mode = CAN_MODE_SILENT;
					hal_status = HAL_CAN_ActivateNotification(&HCAN1, CAN_IT_RX_FIFO0_MSG_PENDING | CAN_IT_RX_FIFO1_MSG_PENDING | CAN_IT_TX_MAILBOX_EMPTY);
					hal_status1 = HAL_CAN_Init(&HCAN1);
					hal_status2 = HAL_CAN_Start(&HCAN1);

					break;

					//--------------------------------------------------------
					// Other modes are not supported
					//
				default:
					return (eCP_ERR_NOT_SUPPORTED);
					break;
			}
		}
	}

	if ((HAL_OK != hal_status) | (HAL_OK != hal_status1) | (HAL_OK != hal_status2))
	{
		return eCP_ERR_INIT_FAIL;
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreCanState()                                                           //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreCanState(CpPort_ts * ptsPortV, CpState_ts * ptsStateV)
{
	uint32_t hal_error;
	uint32_t hal_esr;

	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;

	//----------------------------------------------------------------
	// test CAN port
	//
	if (ptsPortV != (CpPort_ts *) 0L)
	{
		if (ptsPortV->ubDrvInfo > eDRV_INFO_OFF)
		{
			tvStatusT = eCP_ERR_NONE;

			// first set the state of the bus
			ptsStateV->ubCanErrState = eCP_STATE_BUS_ACTIVE;

			// so using this function is maybe not the right way because
			// the error is only handled trough the interrupt handler so
			// maybe it is better to read the status register by hand
			hal_error = HAL_CAN_GetError(&HCAN1);

			if (hal_error & HAL_CAN_ERROR_EWG)
			{
				ptsStateV->ubCanErrState = eCP_STATE_BUS_WARN;
			}

			if (hal_error & HAL_CAN_ERROR_EPV)
			{
				ptsStateV->ubCanErrState = eCP_STATE_BUS_PASSIVE;
			}

			if (hal_error & HAL_CAN_ERROR_BOF)
			{
				ptsStateV->ubCanErrState = eCP_STATE_BUS_OFF;
			}

			// now set the errors first start with error none
			ptsStateV->ubCanErrType = eCP_ERR_TYPE_NONE;

			if (hal_error & HAL_CAN_ERROR_STF)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_STUFF;
			}

			if (hal_error & HAL_CAN_ERROR_FOR)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_FORM;
			}

			if (hal_error & HAL_CAN_ERROR_ACK)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_ACK;
			}

			// bit recessive error
			if (hal_error & HAL_CAN_ERROR_BD)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_BIT0;
			}

			// bit dominant error
			if (hal_error & HAL_CAN_ERROR_BR)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_BIT1;
			}

			if (hal_error & HAL_CAN_ERROR_CRC)
			{
				ptsStateV->ubCanErrType = eCP_ERR_TYPE_CRC;
			}

			//----------------------------------------------------------------
			// get current error counter
			//
			hal_esr = (HCAN1.Instance->ESR) >> 16;
			ptsStateV->ubCanTrmErrCnt = (uint8_t) (hal_esr & 0x000000FF);
			hal_esr = hal_esr >> 8;
			ptsStateV->ubCanRcvErrCnt = (uint8_t) (hal_esr & 0x000000FF);

		}
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreDriverInit()                                                         //
// init CAN controller                                                        //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreDriverInit(uint8_t ubPhyIfV, CpPort_ts * ptsPortV, uint8_t ubConfigV)
{
	uint8_t i;
	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;

	//----------------------------------------------------------------
	// test physical CAN channel
	//
	if (ubPhyIfV == eCP_CHANNEL_1)
	{

#if CP_STATISTIC > 0
		tx1_counter = 0;
		rx1_counter = 0;
		err1_counter = 0;
#endif

		//--------------------------------------------------------
		// test CAN port
		//
		if (ptsPortV != (CpPort_ts *) 0L)
		{
			if (ptsPortV->ubDrvInfo == eDRV_INFO_OFF)
			{
				ptsPortV->ubPhyIf = eCP_CHANNEL_1;
				ptsPortV->ubDrvInfo = eDRV_INFO_INIT;

				// save port
				aptsPortS[0] = ptsPortV;

				//----------------------------------------------
				// hardware initialization
				//

				// clear filter to buffer mapping
				for (i = 0; i < MAX_CAN_FILTER_NUMBER; i++)
				{
					filter_to_cp_buffer[i] = BUFFER_NONE;
				}

				// release all buffers and
				for (i = eCP_BUFFER_1; i < CP_BUFFER_MAX; i++)
				{
					CpCoreBufferRelease(ptsPortV, i);
				}

				for (i = 0; i < 3; i++)
				{
					tx_mailbox_to_buffer[i] = BUFFER_NONE;
				}

				HCAN1.Instance = CAN1;
//				HCAN1.Init.Prescaler = 16;
				HCAN1.Init.Mode = CAN_MODE_NORMAL;
//				HCAN1.Init.SyncJumpWidth = CAN_SJW_1TQ;
//				HCAN1.Init.TimeSeg1 = CAN_BS1_1TQ;
//				HCAN1.Init.TimeSeg2 = CAN_BS2_1TQ;
				HCAN1.Init.TimeTriggeredMode = DISABLE;
				HCAN1.Init.AutoBusOff = DISABLE;
				HCAN1.Init.AutoWakeUp = DISABLE;
				HCAN1.Init.AutoRetransmission = DISABLE;
				HCAN1.Init.ReceiveFifoLocked = DISABLE;
				HCAN1.Init.TransmitFifoPriority = DISABLE;

