liebherrnenzing/canpie-fd_device/stm32/hal/stm32_canpie-fd.c
//				if (can_filter_clear_all() != eCP_ERR_NONE)
//				{
//					return (eCP_ERR_INIT_FAIL);
//				}

				if (HAL_CAN_Init(&HCAN1) != HAL_OK)
				{
					return (eCP_ERR_INIT_FAIL);
				}

//				if (HAL_CAN_Start(&HCAN1) != HAL_OK)
//				{
//					return (eCP_ERR_INIT_FAIL);
//				}

				tvStatusT = eCP_ERR_NONE;
			}
			else
			{
				//---------------------------------------------
				// already initialized
				//
				tvStatusT = eCP_ERR_INIT_FAIL;
			}
		}
		else
		{
			//-----------------------------------------------------
			// parameter ptsPortV is not correct
			//
			tvStatusT = eCP_ERR_PARAM;
		}
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreDriverRelease()                                                      //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreDriverRelease(CpPort_ts * ptsPortV)
{
	CpStatus_tv tvStatusT = eCP_ERR_CHANNEL;
	HAL_StatusTypeDef hal_status;

	//----------------------------------------------------------------
	// test CAN port
	//
	if (ptsPortV != (CpPort_ts *) 0L)
	{
		if (ptsPortV->ubDrvInfo > eDRV_INFO_OFF)
		{
			tvStatusT = CpCoreCanMode(ptsPortV, eCP_MODE_STOP);
			ptsPortV->ubDrvInfo = eDRV_INFO_OFF;

			hal_status = HAL_CAN_DeInit(&HCAN1);

			if ((HAL_OK != hal_status) && (tvStatusT != eCP_ERR_NONE))
			{
				return eCP_ERR_INIT_FAIL;
			}

		}
		else
		{
			tvStatusT = eCP_ERR_INIT_MISSING;
		}
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreFifoConfig()                                                         //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreFifoConfig(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, CpFifo_ts * ptsFifoV)
{
	CpStatus_tv tvStatusT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		if (ptsFifoV != (CpFifo_ts *) 0)
		{
			aptsCan1FifoS[ubBufferIdxV] = ptsFifoV;
		}
		else
		{
			tvStatusT = eCP_ERR_FIFO_PARAM;
		}
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreFifoRead()                                                           //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreFifoRead(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, CpCanMsg_ts * ptsCanMsgV, uint32_t * pulBufferSizeV)
{
	CpFifo_ts *ptsFifoT;
	CpStatus_tv tvStatusT;
	CpCanMsg_ts *ptsCanMsgT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		if (pulBufferSizeV != (uint32_t *) 0L)
		{
			if (ptsCanMsgV != (CpCanMsg_ts *) 0L)
			{
				ptsFifoT = aptsCan1FifoS[ubBufferIdxV];

				//----------------------------------------------------------------
				// check the FIFO
				//
				if (ptsFifoT == 0L)
				{
					return (eCP_ERR_FIFO_PARAM);
				}

				if (CpFifoIsEmpty(ptsFifoT) == 1)
				{
					//--------------------------------------------------------
					// FIFO is empty, no data has been copied
					//
					*pulBufferSizeV = 0;
					tvStatusT = eCP_ERR_FIFO_EMPTY;
				}
				else
				{
					ptsCanMsgT = CpFifoDataOutPtr(ptsFifoT);
					memcpy(ptsCanMsgV, ptsCanMsgT, sizeof(CpCanMsg_ts));
					CpFifoIncOut(ptsFifoT);
					*pulBufferSizeV = 1;
					tvStatusT = eCP_ERR_NONE;
				}

			}
		}
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreFifoRelease()                                                        //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreFifoRelease(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV)
{
	CpStatus_tv tvStatusT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);
	if (tvStatusT == eCP_ERR_NONE)
	{
		aptsCan1FifoS[ubBufferIdxV] = 0L;
	}

	return (tvStatusT);
}

//----------------------------------------------------------------------------//
// CpCoreFifoWrite()                                                          //
//                                                                            //
//----------------------------------------------------------------------------//
CpStatus_tv CpCoreFifoWrite(CpPort_ts * ptsPortV, uint8_t ubBufferIdxV, CpCanMsg_ts * ptsCanMsgV, uint32_t * pulBufferSizeV)
{
	CpFifo_ts * ptsFifoT;
	CpCanMsg_ts * ptsCanMsgT;
	CpStatus_tv tvStatusT;

	//----------------------------------------------------------------
	// test parameter ptsPortV and ubBufferIdxV
	//
	tvStatusT = CheckParam(ptsPortV, ubBufferIdxV, eDRV_INFO_INIT);

	// check if buffer is at least valid
	if ((atsCan1MsgS[ubBufferIdxV].ulMsgUser & (CP_BUFFER_VAL)) != (CP_BUFFER_VAL))
	{
		return eCP_ERR_BUFFER;
	}

	if (tvStatusT == eCP_ERR_NONE)
	{
		if (pulBufferSizeV != (uint32_t *) 0L)
		{
			if (ptsCanMsgV != (CpCanMsg_ts *) 0L)
			{
				ptsFifoT = aptsCan1FifoS[ubBufferIdxV];

				//----------------------------------------------------------------
				// check the FIFO
				//
				if (ptsFifoT == 0L)
				{
					return (eCP_ERR_FIFO_PARAM);
				}

				//----------------------------------------------------------------
				// check if buffer is busy
				//
				if ((atsCan1MsgS[ubBufferIdxV].ulMsgUser & CP_BUFFER_PND) > 0)
				{

					if (CpFifoIsFull(ptsFifoT) == 1)
					{
						//--------------------------------------------------------
						// FIFO is empty, no data has been copied
						//
						*pulBufferSizeV = 0;
						tvStatusT = eCP_ERR_FIFO_FULL;
					}
					else
					{
						ptsCanMsgT = CpFifoDataInPtr(ptsFifoT);
						memcpy(ptsCanMsgT, ptsCanMsgV, sizeof(CpCanMsg_ts));
						CpFifoIncIn(ptsFifoT);
						*pulBufferSizeV = 1;
						tvStatusT = eCP_ERR_NONE;
					}
				}
				else
				{
					memcpy(&atsCan1MsgS[ubBufferIdxV], ptsCanMsgV, sizeof(CpCanMsg_ts));
					CpCoreBufferSend(ptsPortV, ubBufferIdxV);
					tvStatusT = eCP_ERR_NONE;
				}
			}
		}
	}

