liebherrnenzing/canpie-fd_device/stm32/hal/stm32_canpie-fd.c
#if CP_STATISTIC > 0
	tx1_counter++;
#endif
}

void HAL_CAN_TxMailbox1CompleteCallback(CAN_HandleTypeDef* hcan)
{
	int8_t canpie_buffer_number;
	CpFifo_ts *ptsFifoT;
	CpCanMsg_ts *ptsFifoMsgT;
	CpCanMsg_ts *ptsCanMsgT;

	canpie_buffer_number = tx_mailbox_to_buffer[TX_MAILBOX_1];
	//-----------------------------------------------------------------
	// get pointer to CAN buffer
	//
	if (canpie_buffer_number == BUFFER_NONE)
	{
		printf("error should not happen");
		return;
	}

	ptsCanMsgT = &atsCan1MsgS[canpie_buffer_number];

	if (aptsCan1FifoS[canpie_buffer_number] == 0L)
	{
		if ((canpie_buffer_number != BUFFER_NONE) && (CPP_NULL != pfnTrmHandlerS))
		{
			pfnTrmHandlerS(&atsCan1MsgS[canpie_buffer_number], canpie_buffer_number);
		}
	}
	else
	{
		ptsFifoT = aptsCan1FifoS[canpie_buffer_number];
		if (CpFifoIsEmpty(ptsFifoT) == 0)
		{
			ptsFifoMsgT = CpFifoDataOutPtr(ptsFifoT);
			memcpy(ptsCanMsgT, ptsFifoMsgT, sizeof(CpCanMsg_ts));
			CpFifoIncOut(ptsFifoT);
			ptsCanMsgT->ulMsgUser |= CP_BUFFER_PND;
		}
	}

	// clear mailbox buffer 1
	tx_mailbox_to_buffer[TX_MAILBOX_1] = BUFFER_NONE;

	//-----------------------------------------------------------------
	// run through buffer list and test for open Tx requests
	//
	ptsCanMsgT = &atsCan1MsgS[0];
	for (canpie_buffer_number = 0; canpie_buffer_number < CP_BUFFER_MAX; canpie_buffer_number++)
	{
		if (((ptsCanMsgT->ulMsgUser) & CP_BUFFER_PND))
		{
			ptsCanMsgT->ulMsgUser &= ~CP_BUFFER_PND;
			CpCoreBufferSend(aptsPortS[0], canpie_buffer_number);
		}
		ptsCanMsgT++;
	}

#if CP_STATISTIC > 0
	tx1_counter++;
#endif
}

void HAL_CAN_TxMailbox2CompleteCallback(CAN_HandleTypeDef* hcan)
{
	int8_t canpie_buffer_number;
	CpFifo_ts *ptsFifoT;
	CpCanMsg_ts *ptsFifoMsgT;
	CpCanMsg_ts *ptsCanMsgT;

	canpie_buffer_number = tx_mailbox_to_buffer[TX_MAILBOX_2];
	//-----------------------------------------------------------------
	// get pointer to CAN buffer
	//
	if (canpie_buffer_number == BUFFER_NONE)
	{
		printf("error should not happen");
		return;
	}

	ptsCanMsgT = &atsCan1MsgS[canpie_buffer_number];

	if (aptsCan1FifoS[canpie_buffer_number] == 0L)
	{
		if ((canpie_buffer_number != BUFFER_NONE) && (CPP_NULL != pfnTrmHandlerS))
		{
			pfnTrmHandlerS(&atsCan1MsgS[canpie_buffer_number], canpie_buffer_number);
		}
	}
	else
	{
		ptsFifoT = aptsCan1FifoS[canpie_buffer_number];
		if (CpFifoIsEmpty(ptsFifoT) == 0)
		{
			ptsFifoMsgT = CpFifoDataOutPtr(ptsFifoT);
			memcpy(ptsCanMsgT, ptsFifoMsgT, sizeof(CpCanMsg_ts));
			CpFifoIncOut(ptsFifoT);
			ptsCanMsgT->ulMsgUser |= CP_BUFFER_PND;
		}
	}

	// clear mailbox buffer 2
	tx_mailbox_to_buffer[TX_MAILBOX_2] = BUFFER_NONE;

	//-----------------------------------------------------------------
	// run through buffer list and test for open Tx requests
	//
	ptsCanMsgT = &atsCan1MsgS[0];
	for (canpie_buffer_number = 0; canpie_buffer_number < CP_BUFFER_MAX; canpie_buffer_number++)
	{
		if (((ptsCanMsgT->ulMsgUser) & CP_BUFFER_PND))
		{
			ptsCanMsgT->ulMsgUser &= ~CP_BUFFER_PND;
			CpCoreBufferSend(aptsPortS[0], canpie_buffer_number);
		}
		ptsCanMsgT++;
	}

#if CP_STATISTIC > 0
	tx1_counter++;
#endif
}

void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef* hcan)
{
	CpCanMsg_ts *pcan_msg;
	// get filter index
	uint8_t canpie_buffer_number;
	CpFifo_ts *ptsFifoT;
	CpCanMsg_ts *ptsFifoMsgT;

	CAN_RxHeaderTypeDef header;
	uint8_t rx_data[8];

	HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &header, rx_data);

	canpie_buffer_number = filter_to_cp_buffer[header.FilterMatchIndex];

	pcan_msg = &atsCan1MsgS[canpie_buffer_number];

	if (header.IDE == CAN_ID_STD)
	{
		CpMsgSetStdId(pcan_msg, header.StdId);
	}
	else
	{
		CpMsgSetExtId(pcan_msg, header.ExtId);
	}

	if (header.RTR == CAN_RTR_REMOTE)
	{
		CpMsgSetRemote(pcan_msg);
	}
	else
	{
		CpMsgClrRemote(pcan_msg);
	}

	CpMsgSetDlc(pcan_msg, header.DLC);

	pcan_msg->tuMsgData.aubByte[0] = rx_data[0];
	pcan_msg->tuMsgData.aubByte[1] = rx_data[1];
	pcan_msg->tuMsgData.aubByte[2] = rx_data[2];
	pcan_msg->tuMsgData.aubByte[3] = rx_data[3];
	pcan_msg->tuMsgData.aubByte[4] = rx_data[4];
	pcan_msg->tuMsgData.aubByte[5] = rx_data[5];
	pcan_msg->tuMsgData.aubByte[6] = rx_data[6];
	pcan_msg->tuMsgData.aubByte[7] = rx_data[7];

	//pcan_msg->ulMsgUser = hcan->pRxMsg->FIFONumber;

	//-----------------------------------------------------------------
	// test for receive callback handler
	//
	if (aptsCan1FifoS[canpie_buffer_number] == 0L)
	{
		if (CPP_NULL != pfnRcvHandlerS)
		{
			pfnRcvHandlerS(pcan_msg, canpie_buffer_number);
		}
	}
	else
	{
		ptsFifoT = aptsCan1FifoS[canpie_buffer_number];
		if (CpFifoIsFull(ptsFifoT) == 0)
		{
			ptsFifoMsgT = CpFifoDataInPtr(ptsFifoT);
			memcpy(ptsFifoMsgT, pcan_msg, sizeof(CpCanMsg_ts));
			CpFifoIncIn(ptsFifoT);
		}
	}

#if CP_STATISTIC > 0
	rx1_counter++;
#endif
}

/**
 * @todo enable error callback for error counter
 * @param hcan
 */
void HAL_CAN_ErrorCallback(CAN_HandleTypeDef *hcan)
{
	static CpState_ts state;
	/**@todo fill state */
#if CP_STATISTIC > 0
	err1_counter++;
#endif
	/* Enable Error warning, Error passive, Bus-off, Last error and Error Interrupts and FIFO0, FIFO1 */
	__HAL_CAN_ENABLE_IT(hcan, CAN_IT_ERROR_WARNING | CAN_IT_ERROR_PASSIVE | CAN_IT_BUSOFF | CAN_IT_LAST_ERROR_CODE | CAN_IT_ERROR | CAN_IT_TX_MAILBOX_EMPTY | CAN_IT_RX_FIFO0_OVERRUN | CAN_IT_RX_FIFO0_MSG_PENDING| CAN_IT_RX_FIFO1_OVERRUN | CAN_IT_RX_FIFO1_MSG_PENDING);

	if (CPP_NULL != pfnErrHandlerS)
	{
		pfnErrHandlerS(&state);
	}
}
